---
kind: method
id: M:Autodesk.Revit.DB.DirectShape.ResetExternallyTaggedGeometry
source: html/c209aeeb-03c9-9dbb-6b85-dd7e26188c5c.htm
---
# Autodesk.Revit.DB.DirectShape.ResetExternallyTaggedGeometry Method

Removes all of the externally tagged geometry in this DirectShape.

## Syntax (C#)
```csharp
public void ResetExternallyTaggedGeometry()
```